# Пользователь вводит произвольную строку. Выведите кортеж из уникальных символов введённой строки.
stroka = str(input())
print(set(stroka))